In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus']=False

In [30]:
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data,index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

## 1. 산술 ( element wise )

In [4]:
df + 1

   eng  kor  math
a   11   21    91
b   31   41    51
c   51   61    21
d   71   81    71

In [5]:
df*2

   eng  kor  math
a   20   40   180
b   60   80   100
c  100  120    40
d  140  160   140

In [8]:
df['eng'] = [1,2,3,4]
df

   eng  kor  math
a    1   20    90
b    2   40    50
c    3   60    20
d    4   80    70

In [12]:
df['eng'] = df['eng'] + 4
df

   eng  kor  math
a    5   20    90
b    6   40    50
c    7   60    20
d    8   80    70

In [16]:
df.loc['a'] = df.loc['a'] + 2
df

   eng  kor  math
a    7   22    92
b    6   40    50
c    7   60    20
d    8   80    70

In [19]:
df.loc['b':'c', 'kor': ]  = [[1,2],[3,4]] # 2차원 영역 수정하려면 **값도 2차원**으로 줘야함
df

   eng  kor  math
a    7   22    92
b    6    1     2
c    7    3     4
d    8   80    70

In [24]:
df.loc['b':'c', 'kor': ] = df.loc['b':'c', 'kor': ] + 2
df

   eng  kor  math
a    7   22    92
b    6    3     4
c    7    5     6
d    8   80    70

## 2. boolean indexing
- **행** 단위로 불리안 인덱싱한다
- numpy 2차원 데이터의 불리안 인덱싱과 같음

In [25]:
df[[True,True,True,False ]]

   eng  kor  math
a    7   22    92
b    6    3     4
c    7    5     6

## 3. 관계 ( element wise )

In [32]:
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [44]:
df['eng'] > 30

a    False
b    False
c     True
d     True
Name: eng, dtype: bool

In [39]:
df[ df['eng'] > 30 ] # True에 해당하는 행만 선택

   eng  kor  math
c   50   60    20
d   70   80    70

## 4. 논리 ( element wise )
- Series의 **betweeen**( )
- Series의 **isin**( ) 사용 가능
- DataFrame은 df.**query**( )를 제공
    - sql문처럼 작성
    - query() 안에는 **문자열**로 작성
    - 조건에 맞는 데이터 추출할 때 유용
        - 이때 주의할 점은 함수 내부가 문자열로 구성되기 때문에 외부에 있는 변수를 사용하려면,
            문자열 포맷팅을 이용해야함
            - f'{ text }'
            - '{ }'.format( text )
            - ' %s %s'%( text )

In [43]:
(df['kor'] == 20) | (df['kor'] == 40)

a     True
b     True
c    False
d    False
Name: kor, dtype: bool

In [45]:
df[ (df['kor'] == 20) | (df['kor'] == 40) ]

   eng  kor  math
a   10   20    90
b   30   40    50

In [50]:
df['kor'].isin([20,40])

a     True
b     True
c    False
d    False
Name: kor, dtype: bool

In [51]:
df[ df['kor'].isin([20,40]) ]

   eng  kor  math
a   10   20    90
b   30   40    50

### *query( '문자열' )
- 조건별 데이터 선택가능

In [54]:
# df[ df['eng'] > 30 ]
df.query( 'eng > 30' )

   eng  kor  math
c   50   60    20
d   70   80    70

In [56]:
# df[ (df['kor'] == 20) | (df['kor'] == 40) ]
df.query( 'kor == 20 or kor == 40 ')

   eng  kor  math
a   10   20    90
b   30   40    50

In [58]:
# df[ (df['kor'] >= 20) and (df['kor'] <= 60) ]
df.query( '20 <= kor <= 60' )

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [60]:
num = 30
# df[ df['eng'] > num ]
df.query( f'eng > {num}' ) # 문자열이기 때문에 변수 사용시 **문자열 포맷팅**해줘야함

   eng  kor  math
c   50   60    20
d   70   80    70